# Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

- Key Features  
    a. Works seemlessly with structured data formats like CSV, excel  
    b. Handles missing values easily  
    c. Built on numpy for fast computation
  
- Why use Pandas?  
    a. Performance: Handles millions of rows efficiently  
    b. Ease of Use: Beginner-friendly syntax for cleaning and transforming data  
    c. Integration: Works well with libraries like matplotlib and Scikit-Learn   

- Real life examples of Pandas in Action  
    a. Finance - Analyzing time-series data like stock prices to identify market trends  
    b. Retail - Tracking inventory and finding the most sold products in a store  
    c. Healthcare - Analysing patient records and outcomes from clinical trials

Overlap between NumPy and Pandas  
NumPy: ndarray → can be 1D (vector), 2D (matrix), nD (tensor).  
Pandas:  
Series → basically a 1D labeled array.  
DataFrame → basically a 2D labeled array (can be seen as a special tensor).  
So why not just stick to NumPy?

1. It adds labels (not just numbers).
2. Handles heterogeneous data (different types per column).
3. Provides high-level operations (filter, group, merge, pivot) that NumPy doesn’t.
    - NumPy = low-level numerical operations (fast, vectorized).
    - Pandas = high-level data analysis operations (built on top of NumPy).

You can implement filtering, merging, pivot-like reshaping in NumPy, but Pandas makes it more expressive, less error-prone, and directly tied to column/row labels.

Key Differences between Data Manipulation and Data Analysis

In [4]:
# Execute the cell to know the Differences
import pandas as pd
data = [{'Data Manipulation' : 'Preparing and Cleaning Data', 'Data Analysis' : 'Extracting insights from prepared data'}, 
{'Data Manipulation' : 'Organize and structure raw data', 'Data Analysis' : 'Find Patterns, trends and solve problems'}, 
{'Data Manipulation' : 'Fixing errors in student grade sheet', 'Data Analysis' : 'Analyzing which student scored the highest'}]
df = pd.DataFrame(data, index=['Focus','Goal','Example'])
from tabulate import tabulate
print(tabulate(df, headers="keys", tablefmt="fancy_grid"))

╒═════════╤══════════════════════════════════════╤════════════════════════════════════════════╕
│         │ Data Manipulation                    │ Data Analysis                              │
╞═════════╪══════════════════════════════════════╪════════════════════════════════════════════╡
│ Focus   │ Preparing and Cleaning Data          │ Extracting insights from prepared data     │
├─────────┼──────────────────────────────────────┼────────────────────────────────────────────┤
│ Goal    │ Organize and structure raw data      │ Find Patterns, trends and solve problems   │
├─────────┼──────────────────────────────────────┼────────────────────────────────────────────┤
│ Example │ Fixing errors in student grade sheet │ Analyzing which student scored the highest │
╘═════════╧══════════════════════════════════════╧════════════════════════════════════════════╛

## Series and DataFrames
### Series

A series is a one dimensional labeled array that can hold any data type. Each element in Series has a unique label called an index.  
It is often used to track changes or patterns over time such as daily temperatures, stock prices or sales revenue

### DataFrame

A DataFrame is a two dimension labeled data structure in Pandas, similar to table in a database, an excel spreadsheet or a SQL table.  
It consists of rows and columns, where:  
- Rows have indices  
- Columns have names

In [1]:
import pandas as pd
df = pd.read_csv('sales_data_sample.csv')
df

UnicodeDecodeError: 'utf-8' codec can't decode byte 0x84 in position 5327: invalid start byte

In [4]:
# Encoding is a process of converting tax into a format that computer can read and store. Common encoding is UTF-8 and latin1
df = pd.read_csv('sales_data_sample.csv', encoding='latin1')
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [ ]:
# For excel files
df = pd.read_excel("")
# For JSON files
df = pd.read_json("")
# For reading data from cloud platform we use gcsfs

In [ ]:
# How to save Data

data = {
    "Name" : ['Ram', 'Shyam', 'Ghanshyam'],
    "Age" : [21,22,24],
    "City" : ['Nagpur', 'Mumbai', 'Delhi']
}
df = pd.DataFrame(data)
print(df)
df.to_csv("output.csv", index=False)

        Name  Age    City
0        Ram   21  Nagpur
1      Shyam   22  Mumbai
2  Ghanshyam   24   Delhi

In [6]:
# How to explore Data

# 1. Understand the Dataset
# 2. Identify the problems
# 3. Plan next steps

df = pd.read_csv('sales_data_sample.csv', encoding='latin1')
print(df.head()) # By default top 5 rows, and if we want n number of rows, we can pass it as argument
print(df.tail()) # last 5 rows
print(df.tail(1))

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...
1    5/7/2003 0:00  Shipped       2         5     2003  ...
2    7/1/2003 0:00  Shipped       3         7     2003  ...
3   8/25/2003 0:00  Shipped       3         8     2003  ...
4  10/10/2003 0:00  Shipped       4        10     2003  ...

                    ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0        897 Long Airport Avenue           NaN            NYC    NY
1             59 rue de l'Abbaye           NaN          Reims   NaN
2  27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3             78934 Hillside Dr.           NaN       Pasadena    CA
4                7734 Strong St.           NaN  San Francisco    CA

  POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0      10022     USA       NaN              Yu             Kwai    Small
1      51100  France      EMEA         Henriot             Paul    Small
2      75508  France      EMEA        Da Cunha           Daniel   Medium
3      90003     USA       NaN           Young            Julie   Medium
4        NaN     USA       NaN           Brown            Julie   Medium

[5 rows x 25 columns]
      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

           ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
2818  12/2/2004 0:00   Shipped       4        12     2004  ...
2819  1/31/2005 0:00   Shipped       1         1     2005  ...
2820   3/1/2005 0:00  Resolved       1         3     2005  ...
2821  3/28/2005 0:00   Shipped       1         3     2005  ...
2822   5/6/2005 0:00   On Hold       2         5     2005  ...

               ADDRESSLINE1  ADDRESSLINE2      CITY STATE POSTALCODE  COUNTRY  \
2818     C/ Moralzarzal, 86           NaN    Madrid   NaN      28034    Spain
2819            Torikatu 38           NaN      Oulu   NaN      90110  Finland
2820     C/ Moralzarzal, 86           NaN    Madrid   NaN      28034    Spain
2821  1 rue Alsace-Lorraine           NaN  Toulouse   NaN      31000   France
2822     8616 Spinnaker Dr.           NaN    Boston    MA      51003      USA

     TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
2818      EMEA          Freyre            Diego    Small
2819      EMEA       Koskitalo           Pirkko   Medium
2820      EMEA          Freyre            Diego   Medium
2821      EMEA          Roulet          Annette    Small
2822       NaN         Yoshido             Juri   Medium

[5 rows x 25 columns]
      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
2822        10414               47      65.52                9  3079.44

          ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
2822  5/6/2005 0:00  On Hold       2         5     2005  ...

            ADDRESSLINE1  ADDRESSLINE2    CITY STATE POSTALCODE COUNTRY  \
2822  8616 Spinnaker Dr.           NaN  Boston    MA      51003     USA

     TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
2822       NaN         Yoshido             Juri   Medium

[1 rows x 25 columns]

In [7]:
# Number of Rows x Columns
# What type of data
# Missing data

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2823 entries, 0 to 2822
Data columns (total 25 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       2823 non-null   int64
 1   QUANTITYORDERED   2823 non-null   int64
 2   PRICEEACH         2823 non-null   float64
 3   ORDERLINENUMBER   2823 non-null   int64
 4   SALES             2823 non-null   float64
 5   ORDERDATE         2823 non-null   object
 6   STATUS            2823 non-null   object
 7   QTR_ID            2823 non-null   int64
 8   MONTH_ID          2823 non-null   int64
 9   YEAR_ID           2823 non-null   int64
 10  PRODUCTLINE       2823 non-null   object
 11  MSRP              2823 non-null   int64
 12  PRODUCTCODE       2823 non-null   object
 13  CUSTOMERNAME      2823 non-null   object
 14  PHONE             2823 non-null   object
 15  ADDRESSLINE1      2823 non-null   object
 16  ADDRESSLINE2      302 non-null    object
 17  CITY              2823 non-null   object
 18  STATE             1337 non-null   object
 19  POSTALCODE        2747 non-null   object
 20  COUNTRY           2823 non-null   object
 21  TERRITORY         1749 non-null   object
 22  CONTACTLASTNAME   2823 non-null   object
 23  CONTACTFIRSTNAME  2823 non-null   object
 24  DEALSIZE          2823 non-null   object
dtypes: float64(2), int64(7), object(16)
memory usage: 551.5+ KB

In [ ]:
# Descreptive Statistics
print(df.describe())
# Count - non missing values in each columns
# Mean - The arethmetic average of numbers in each column
# std - standard deviations - small std - values which are very close to mean, means all data is similar and has less deviations
#                             large std - values which are very far from mean, means the deviation is a lot
# min - minimum value of column
# max - maximum value of column
# 25% 50% 75% - Value at 1/4th point, 1/2 point or median point, 3/4th point of your data.

        ORDERNUMBER  QUANTITYORDERED    PRICEEACH  ORDERLINENUMBER  \
count   2823.000000      2823.000000  2823.000000      2823.000000
mean   10258.725115        35.092809    83.658544         6.466171
std       92.085478         9.741443    20.174277         4.225841
min    10100.000000         6.000000    26.880000         1.000000
25%    10180.000000        27.000000    68.860000         3.000000
50%    10262.000000        35.000000    95.700000         6.000000
75%    10333.500000        43.000000   100.000000         9.000000
max    10425.000000        97.000000   100.000000        18.000000

              SALES       QTR_ID     MONTH_ID     YEAR_ID         MSRP
count   2823.000000  2823.000000  2823.000000  2823.00000  2823.000000
mean    3553.889072     2.717676     7.092455  2003.81509   100.715551
std     1841.865106     1.203878     3.656633     0.69967    40.187912
min      482.130000     1.000000     1.000000  2003.00000    33.000000
25%     2203.430000     2.000000     4.000000  2003.00000    68.000000
50%     3184.800000     3.000000     8.000000  2004.00000    99.000000
75%     4508.000000     4.000000    11.000000  2004.00000   124.000000
max    14082.800000     4.000000    12.000000  2005.00000   214.000000

In [12]:
# How big is your dataset
# What are the names of the columns
#  Shape and Columns
print(df.shape)
print(df.columns)

(2823, 25)
Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

In [14]:
# Select specific column, filter rows, combine multiple conditions
column = df["CITY"] # Returns Series
subset = df[["CITY","COUNTRY", "TERRITORY"]] # Returns dataframe
print(column)
print(subset)

0                 NYC
1               Reims
2               Paris
3            Pasadena
4       San Francisco
            ...
2818           Madrid
2819             Oulu
2820           Madrid
2821         Toulouse
2822           Boston
Name: CITY, Length: 2823, dtype: object
               CITY  COUNTRY TERRITORY
0               NYC      USA       NaN
1             Reims   France      EMEA
2             Paris   France      EMEA
3          Pasadena      USA       NaN
4     San Francisco      USA       NaN
...             ...      ...       ...
2818         Madrid    Spain      EMEA
2819           Oulu  Finland      EMEA
2820         Madrid    Spain      EMEA
2821       Toulouse   France      EMEA
2822         Boston      USA       NaN

[2823 rows x 3 columns]

In [ ]:
# Filter
print(df[df['PRICEEACH'] > 50])
print(df[(df['PRICEEACH'] > 50) & (df['PRICEEACH'] < 90)]) # For OR condition we use this => |

      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0           10107               30      95.70                2  2871.00
1           10121               34      81.35                5  2765.90
2           10134               41      94.74                2  3884.34
3           10145               45      83.26                6  3746.70
4           10159               49     100.00               14  5205.27
...           ...              ...        ...              ...      ...
2818        10350               20     100.00               15  2244.40
2819        10373               29     100.00                1  3978.51
2820        10386               43     100.00                4  5417.57
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
0      2/24/2003 0:00   Shipped       1         2     2003  ...
1       5/7/2003 0:00   Shipped       2         5     2003  ...
2       7/1/2003 0:00   Shipped       3         7     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
4     10/10/2003 0:00   Shipped       4        10     2003  ...
...               ...       ...     ...       ...      ...  ...
2818   12/2/2004 0:00   Shipped       4        12     2004  ...
2819   1/31/2005 0:00   Shipped       1         1     2005  ...
2820    3/1/2005 0:00  Resolved       1         3     2005  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                       ADDRESSLINE1  ADDRESSLINE2           CITY STATE  \
0           897 Long Airport Avenue           NaN            NYC    NY
1                59 rue de l'Abbaye           NaN          Reims   NaN
2     27 rue du Colonel Pierre Avia           NaN          Paris   NaN
3                78934 Hillside Dr.           NaN       Pasadena    CA
4                   7734 Strong St.           NaN  San Francisco    CA
...                             ...           ...            ...   ...
2818             C/ Moralzarzal, 86           NaN         Madrid   NaN
2819                    Torikatu 38           NaN           Oulu   NaN
2820             C/ Moralzarzal, 86           NaN         Madrid   NaN
2821          1 rue Alsace-Lorraine           NaN       Toulouse   NaN
2822             8616 Spinnaker Dr.           NaN         Boston    MA

     POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME DEALSIZE
0         10022      USA       NaN              Yu             Kwai    Small
1         51100   France      EMEA         Henriot             Paul    Small
2         75508   France      EMEA        Da Cunha           Daniel   Medium
3         90003      USA       NaN           Young            Julie   Medium
4           NaN      USA       NaN           Brown            Julie   Medium
...         ...      ...       ...             ...              ...      ...
2818      28034    Spain      EMEA          Freyre            Diego    Small
2819      90110  Finland      EMEA       Koskitalo           Pirkko   Medium
2820      28034    Spain      EMEA          Freyre            Diego   Medium
2821      31000   France      EMEA          Roulet          Annette    Small
2822      51003      USA       NaN         Yoshido             Juri   Medium

[2571 rows x 25 columns]
      ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
1           10121               34      81.35                5  2765.90
3           10145               45      83.26                6  3746.70
6           10180               29      86.13                9  2497.77
21          10361               20      72.55               13  1451.00
23          10388               42      76.36                4  3207.12
...           ...              ...        ...              ...      ...
2814        10306               35      59.51                6  2082.85
2815        10315               40      55.69                5  2227.60
2816        10327               37      86.74                4  3209.38
2821        10397               34      62.24                1  2116.16
2822        10414               47      65.52                9  3079.44

            ORDERDATE    STATUS  QTR_ID  MONTH_ID  YEAR_ID  ...  \
1       5/7/2003 0:00   Shipped       2         5     2003  ...
3      8/25/2003 0:00   Shipped       3         8     2003  ...
6     11/11/2003 0:00   Shipped       4        11     2003  ...
21    12/17/2004 0:00   Shipped       4        12     2004  ...
23      3/3/2005 0:00   Shipped       1         3     2005  ...
...               ...       ...     ...       ...      ...  ...
2814  10/14/2004 0:00   Shipped       4        10     2004  ...
2815  10/29/2004 0:00   Shipped       4        10     2004  ...
2816  11/10/2004 0:00  Resolved       4        11     2004  ...
2821   3/28/2005 0:00   Shipped       1         3     2005  ...
2822    5/6/2005 0:00   On Hold       2         5     2005  ...

                                 ADDRESSLINE1  ADDRESSLINE2         CITY  \
1                          59 rue de l'Abbaye           NaN        Reims
3                          78934 Hillside Dr.           NaN     Pasadena
6                     184, chausse de Tournai           NaN        Lille
21    Monitor Money Building, 815 Pacific Hwy       Level 6    Chatswood
23                          1785 First Street           NaN  New Bedford
...                                       ...           ...          ...
2814                        Fauntleroy Circus           NaN   Manchester
2815             67, rue des Cinquante Otages           NaN       Nantes
2816                             Vinb'ltet 34           NaN    Kobenhavn
2821                    1 rue Alsace-Lorraine           NaN     Toulouse
2822                       8616 Spinnaker Dr.           NaN       Boston

     STATE POSTALCODE    COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME  \
1      NaN      51100     France      EMEA         Henriot             Paul
3       CA      90003        USA       NaN           Young            Julie
6      NaN      59000     France      EMEA           Rance          Martine
21     NSW       2067  Australia      APAC          Huxley           Adrian
23      MA      50553        USA       NaN         Benitez          Violeta
...    ...        ...        ...       ...             ...              ...
2814   NaN    EC2 5NT         UK      EMEA        Ashworth         Victoria
2815   NaN      44000     France      EMEA         Labrune           Janine
2816   NaN       1734    Denmark      EMEA        Petersen            Jytte
2821   NaN      31000     France      EMEA          Roulet          Annette
2822    MA      51003        USA       NaN         Yoshido             Juri

     DEALSIZE
1       Small
3      Medium
6       Small
21      Small
23     Medium
...       ...
2814    Small
2815    Small
2816   Medium
2821    Small
2822   Medium

[1037 rows x 25 columns]

In [18]:
# Adding Columns
# Using square brackets
df['New Column'] = df['SALES'] / 2 # Here we do not have freedom to add column where we want
print(df.head())

   ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER    SALES  \
0        10107               30      95.70                2  2871.00
1        10121               34      81.35                5  2765.90
2        10134               41      94.74                2  3884.34
3        10145               45      83.26                6  3746.70
4        10159               49     100.00               14  5205.27

         ORDERDATE   STATUS  QTR_ID  MONTH_ID  YEAR_ID  ... ADDRESSLINE2  \
0   2/24/2003 0:00  Shipped       1         2     2003  ...          NaN
1    5/7/2003 0:00  Shipped       2         5     2003  ...          NaN
2    7/1/2003 0:00  Shipped       3         7     2003  ...          NaN
3   8/25/2003 0:00  Shipped       3         8     2003  ...          NaN
4  10/10/2003 0:00  Shipped       4        10     2003  ...          NaN

            CITY STATE POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME  \
0            NYC    NY      10022     USA       NaN              Yu
1          Reims   NaN      51100  France      EMEA         Henriot
2          Paris   NaN      75508  France      EMEA        Da Cunha
3       Pasadena    CA      90003     USA       NaN           Young
4  San Francisco    CA        NaN     USA       NaN           Brown

  CONTACTFIRSTNAME DEALSIZE New Column
0             Kwai    Small   1435.500
1             Paul    Small   1382.950
2           Daniel   Medium   1942.170
3            Julie   Medium   1873.350
4            Julie   Medium   2602.635

[5 rows x 26 columns]

In [19]:
# using insert(location, "Column Name", data) => Commonly used
df.insert(0, "New Column 2", df["New Column"])
print(df.tail())

      New Column 2  ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  \
2818      1122.200        10350               20     100.00               15
2819      1989.255        10373               29     100.00                1
2820      2708.785        10386               43     100.00                4
2821      1058.080        10397               34      62.24                1
2822      1539.720        10414               47      65.52                9

        SALES       ORDERDATE    STATUS  QTR_ID  MONTH_ID  ...  ADDRESSLINE2  \
2818  2244.40  12/2/2004 0:00   Shipped       4        12  ...           NaN
2819  3978.51  1/31/2005 0:00   Shipped       1         1  ...           NaN
2820  5417.57   3/1/2005 0:00  Resolved       1         3  ...           NaN
2821  2116.16  3/28/2005 0:00   Shipped       1         3  ...           NaN
2822  3079.44   5/6/2005 0:00   On Hold       2         5  ...           NaN

          CITY  STATE POSTALCODE  COUNTRY TERRITORY CONTACTLASTNAME  \
2818    Madrid    NaN      28034    Spain      EMEA          Freyre
2819      Oulu    NaN      90110  Finland      EMEA       Koskitalo
2820    Madrid    NaN      28034    Spain      EMEA          Freyre
2821  Toulouse    NaN      31000   France      EMEA          Roulet
2822    Boston     MA      51003      USA       NaN         Yoshido

     CONTACTFIRSTNAME DEALSIZE New Column
2818            Diego    Small   1122.200
2819           Pirkko   Medium   1989.255
2820            Diego   Medium   2708.785
2821          Annette    Small   1058.080
2822             Juri   Medium   1539.720

[5 rows x 27 columns]

In [20]:
# Updating Values .loc[""] used to access a cell and modify it
#df.loc[row_index, 'Column Name'] = new value
df.loc[0, 'New Column'] = 0
print(df.head(1))

   New Column 2  ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  \
0        1435.5        10107               30       95.7                2

    SALES       ORDERDATE   STATUS  QTR_ID  MONTH_ID  ...  ADDRESSLINE2 CITY  \
0  2871.0  2/24/2003 0:00  Shipped       1         2  ...           NaN  NYC

   STATE POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME CONTACTFIRSTNAME  \
0     NY      10022     USA       NaN              Yu             Kwai

  DEALSIZE New Column
0    Small        0.0

[1 rows x 27 columns]

In [21]:
# Update more than one value || whole column
df['New Column'] = df['New Column'] * 0
print(df.head())

   New Column 2  ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  \
0      1435.500        10107               30      95.70                2
1      1382.950        10121               34      81.35                5
2      1942.170        10134               41      94.74                2
3      1873.350        10145               45      83.26                6
4      2602.635        10159               49     100.00               14

     SALES        ORDERDATE   STATUS  QTR_ID  MONTH_ID  ...  ADDRESSLINE2  \
0  2871.00   2/24/2003 0:00  Shipped       1         2  ...           NaN
1  2765.90    5/7/2003 0:00  Shipped       2         5  ...           NaN
2  3884.34    7/1/2003 0:00  Shipped       3         7  ...           NaN
3  3746.70   8/25/2003 0:00  Shipped       3         8  ...           NaN
4  5205.27  10/10/2003 0:00  Shipped       4        10  ...           NaN

            CITY  STATE POSTALCODE COUNTRY TERRITORY CONTACTLASTNAME  \
0            NYC     NY      10022     USA       NaN              Yu
1          Reims    NaN      51100  France      EMEA         Henriot
2          Paris    NaN      75508  France      EMEA        Da Cunha
3       Pasadena     CA      90003     USA       NaN           Young
4  San Francisco     CA        NaN     USA       NaN           Brown

  CONTACTFIRSTNAME DEALSIZE New Column
0             Kwai    Small        0.0
1             Paul    Small        0.0
2           Daniel   Medium        0.0
3            Julie   Medium        0.0
4            Julie   Medium        0.0

[5 rows x 27 columns]

In [22]:
# Removing Columns
# df.drop(columns = ["Column Name"], inplace=True) inplace =True means making changes in original instead of returning new
df.drop(columns=["New Column"], inplace=True)
df.head()

,New Column 2,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,1435.500,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,1382.950,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,1942.170,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,1873.350,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,2602.635,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [23]:
# Handling Missing Data
# NaN - not a number - pandas treat missing data as NaN
# None (for object data types)
# First we need to identify where data is missing - for this we use - isnull() - returns in true or false
print(df.isnull())

      New Column 2  ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  \
0            False        False            False      False            False
1            False        False            False      False            False
2            False        False            False      False            False
3            False        False            False      False            False
4            False        False            False      False            False
...            ...          ...              ...        ...              ...
2818         False        False            False      False            False
2819         False        False            False      False            False
2820         False        False            False      False            False
2821         False        False            False      False            False
2822         False        False            False      False            False

      SALES  ORDERDATE  STATUS  QTR_ID  MONTH_ID  ...  ADDRESSLINE1  \
0     False      False   False   False     False  ...         False
1     False      False   False   False     False  ...         False
2     False      False   False   False     False  ...         False
3     False      False   False   False     False  ...         False
4     False      False   False   False     False  ...         False
...     ...        ...     ...     ...       ...  ...           ...
2818  False      False   False   False     False  ...         False
2819  False      False   False   False     False  ...         False
2820  False      False   False   False     False  ...         False
2821  False      False   False   False     False  ...         False
2822  False      False   False   False     False  ...         False

      ADDRESSLINE2   CITY  STATE  POSTALCODE  COUNTRY  TERRITORY  \
0             True  False  False       False    False       True
1             True  False   True       False    False      False
2             True  False   True       False    False      False
3             True  False  False       False    False       True
4             True  False  False        True    False       True
...            ...    ...    ...         ...      ...        ...
2818          True  False   True       False    False      False
2819          True  False   True       False    False      False
2820          True  False   True       False    False      False
2821          True  False   True       False    False      False
2822          True  False  False       False    False       True

      CONTACTLASTNAME  CONTACTFIRSTNAME  DEALSIZE
0               False             False     False
1               False             False     False
2               False             False     False
3               False             False     False
4               False             False     False
...               ...               ...       ...
2818            False             False     False
2819            False             False     False
2820            False             False     False
2821            False             False     False
2822            False             False     False

[2823 rows x 26 columns]

In [ ]:
print(df.isnull().sum()) # Returns a series of count of missing values in each column

New Column 2           0
ORDERNUMBER            0
QUANTITYORDERED        0
PRICEEACH              0
ORDERLINENUMBER        0
SALES                  0
ORDERDATE              0
STATUS                 0
QTR_ID                 0
MONTH_ID               0
YEAR_ID                0
PRODUCTLINE            0
MSRP                   0
PRODUCTCODE            0
CUSTOMERNAME           0
PHONE                  0
ADDRESSLINE1           0
ADDRESSLINE2        2521
CITY                   0
STATE               1486
POSTALCODE            76
COUNTRY                0
TERRITORY           1074
CONTACTLASTNAME        0
CONTACTFIRSTNAME       0
DEALSIZE               0
dtype: int64

In [ ]:
# dropna(axis, inplace) axis 0 for rows and 1 for removing missing values in columns
df.dropna(inplace=True)
print(df.isnull().sum())

In [ ]:
#fillna(value, inplace) # replaces missing value
df['New Column 2'].fillna(df['New Column 2'].mean(), inplace=True)

In [ ]:
# Interpolation
# You fill missing data with mathematically calculated values which makes the most sense after detecting a pattern in numbers before to after it
# Types of interpolation - linear, polynomial, time, index, values, nearest, zero(Step wise), spline => slinear, quadratic, cubic
df.interpolate(method="linear", axis=0, inplace=True)

In [31]:
# Sorting and Aggregation
# Sorting data in 1 column
# df.sort_values(by="column-name", True for Ascending else False, inplace)
df.sort_values(by='ORDERNUMBER', ascending=True, inplace=True)
df.head()

,New Column 2,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
55,1396.930,10120,29,96.34,3,2793.86,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small
81,4632.430,10120,46,100.00,2,9264.86,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Large
805,1337.450,10120,46,58.15,4,2674.90,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small
782,1041.245,10120,29,71.81,8,2082.49,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small
2174,1230.680,10120,22,100.00,6,2461.36,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small

In [34]:
# Sorting multiple Columns
df.sort_values(by=["ORDERNUMBER", "ORDERLINENUMBER"], ascending=[True, True], inplace=True)

In [35]:
df.head()

,New Column 2,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
1467,1715.875,10120,35,98.05,1,3431.75,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Medium
81,4632.430,10120,46,100.00,2,9264.86,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Large
55,1396.930,10120,29,96.34,3,2793.86,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small
805,1337.450,10120,46,58.15,4,2674.90,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small
1565,1424.430,10120,34,83.79,5,2848.86,4/29/2003 0:00,Shipped,2,4,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Small

In [37]:
# Aggregation - involves calculating summary statistics
# Numerical summaries of columns - summary statistics
print(df["SALES"].mean())

3446.003537414966

In [ ]:
# Grouping 
df.groupby("ORDERNUMBER")["ORDERLINENUMBER"].sum()
# ORDERNUMBER - 10120 -> [1,2,3,4,5] example
#.sum() - 10120 -> 15

ORDERNUMBER
10120    120
10125      3
10139     36
10148    105
10169     91
10223    120
10270     66
10342     66
10347     78
10361    105
10370     45
10391     55
10420     91
Name: ORDERLINENUMBER, dtype: int64